<!-- dflook/terraform-github-actions {"workspace":"repository_dispatch-test-2","backend_type":"remote","backend":"c14f15e2306fbd66d52643aaf72168815a04c895d0a1da6e3bfdb0f6e692cf08","plan_job_ref":"Job Test Terraform cloud #164 at https://github.com/dflook/terraform-github-actions/actions/runs/5391053560","plan_hash":"e4f13a815a248812eb9a760931a71a31d4eab7976ecd86862cc0d588e7781359","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __repository_dispatch-test-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + default        = "default"
  + from_tfvars    = "from_tfvars"
  + from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #164](https://github.com/dflook/terraform-github-actions/actions/runs/5391053560)